class KSA {
  static final Map<String, Map<String, List<String>>> regions = {
    "منطقة الرياض": {
      "الرياض": [
        "حي العمل",
        "حي النموذجية",
        "حي الجرادية",
        "حي الصناعية",
        "حي منفوحة الجديدة",
        "حي الفاخرية",
        "حي الديرة",
        "حي ام الحمام الشرقي",
        "حي الشرفية",
        "حي الهدا",
        "حي المعذر الشمالي",
        "حي ام الحمام الغربي",
        "حي الرحمانية",
        "حي لبن",
        "حي الرفيعة",
        "حي الشهداء",
        "حي الملك فهد",
        "حي السويدي",
        "حي الحزم",
        "حي عتيقة",
        "حي المربع",
        "حي الفلاح",
        "حي الندى",
        "حي المرسلات",
        "حي النزهة",
        "حي الورود",
        "حي الملك فيصل",
        "المدينة الصناعية الثانية",
        "حي العزيزية",
        "حي المنصورة",
        "حي غبيرة",
        "حي الفاروق",
        "حي الفيصلية",
        "حي الخالدية",
        "حي الجزيرة",
        "حي السعادة",
        "حي الناصرية",
        "حي المناخ",
        "حي الدفاع",
        "حي النور",
        "حي الملك عبدالله",
        "حي الواحة",
        "حي صلاح الدين",
        "حي الملك عبدالعزيز",
        "حي الوزارات",
        "حي سكيرينة",
        "حي الربوة",
        "حي جرير",
        "حي المعذر",
        "حي الصالحية",
        "حي الملز",
        "حي منفوحة",
        "حي عليشة",
        "حي النهضة",
        "حي الخليج",
        "حي الضباط",
        "حي السويدي الغربي",
        "حي ديراب",
        "حي احد",
        "حي نمار"
      ],
    },
    "منطقة مكة المكرمة": {
      "مكة": [
        "حي العزيزية",
        "حي النزهة",
        "حي الشيشة",
        "حي الحمراء",
        "حي المعابدة",
        "حي الشرائع",
        "حي النسيم",
        "حي الهجلة",
        "حي الشوقية"
      ],
      "جدة": [
        "حي الحمرا",
        "حي الروضة",
        "حي البوادي",
        "حي النعيم",
        "حي الصفا",
        "حي السلامة",
        "حي المرجان",
        "حي البساتين",
        "حي الحرازات",
        "حي الاجواد"
      ],
    },
    "المنطقة الشرقية": {
      "الدمام": [
        "حي الفيصلية",
        "حي الشاطئ",
        "حي العزيزية",
        "حي النور",
        "حي الحمراء",
        "حي الجامعيين"
      ],
      "الأحساء": [
        "الهفوف",
        "المبرز",
        "حي محاسن",
        "حي السلام",
        "حي النخيل",
        "حي اليحيى"
      ],
    },
    "منطقة المدينة المنورة": {
      "المدينة المنورة": [
        "حي القدس",
        "حي النهضة",
        "حي قربان",
        "حي الدويمة",
        "حي العيون"
      ],
      "ينبع": [
        "حي البحر",
        "حي الخالدية",
        "حي النزهة",
        "حي الصناعية",
        "حي الجابرية"
      ],
    },
    "منطقة القصيم": {
      "بريدة": [
        "حي المنتزه",
        "حي الواحة",
        "حي الرفيعة",
        "حي النخيل",
        "حي الفايزية"
      ],
      "عنيزة": [
        "حي البساتين",
        "حي الخرجية",
        "حي الريان",
        "حي الملك خالد",
        "حي المنتزه"
      ],
    },
    "منطقة عسير": {
      "أبها": ["حي السد", "حي المنسك", "حي النميص", "حي شمسان", "حي الموظفين"],
      "خميس مشيط": [
        "حي اليرموك",
        "حي المطار",
        "حي الضيافة",
        "حي العزيزية",
        "حي الراقي"
      ],
    },
    "منطقة تبوك": {
      "تبوك": [
        "حي الورود",
        "حي المروج",
        "حي الصفا",
        "حي العزيزية",
        "حي النهضة"
      ],
    },
    "منطقة حائل": {
      "حائل": [
        "حي المنتزه",
        "حي الخزامى",
        "حي العزيزية",
        "حي الجامعيين",
        "حي الزبارة"
      ],
    },
    "منطقة جازان": {
      "جازان": [
        "حي السويس",
        "حي المطار",
        "حي الشاطئ",
        "حي الروابي",
        "حي المروج"
      ],
    },
    "منطقة نجران": {
      "نجران": [
        "حي الفيصلية",
        "حي الفهد",
        "حي العريسة",
        "حي الروضة",
        "حي الصناعية"
      ],
    },
    "منطقة الباحة": {
      "الباحة": [
        "حي الظفير",
        "حي الشفا",
        "حي بني سار",
        "حي الغوث",
        "حي المطار"
      ],
    },
    "منطقة الجوف": {
      "سكاكا": [
        "حي المحمدية",
        "حي الشفا",
        "حي العزيزية",
        "حي الروابي",
        "حي الرحمانية"
      ],
    },
    "منطقة الحدود الشمالية": {
      "عرعر": [
        "حي المساعدية",
        "حي الصالحية",
        "حي الفيصلية",
        "حي الروضة",
        "حي الريان"
      ],
    },
  };
}
